temp1/src/DataProcessors/ГенерацияТокенов/ГенерацияТокенов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГенерацияТокенов</name>
</mdclass:DataProcessor>

temp1/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовВДне</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКалендарь</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>UIDПользователя</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчики</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>TTL</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиТокена</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказчикиТЧ</name>
    <attributes>
      <name>ЗаказчикиДляТЧ</name>
      <type>
        <types>CatalogRef.Заказчики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/DataProcessors/ГенерацияТокенов/Forms/Форма1/Module.bsl
&НаКлиенте
Процедура ПользовательВыборПриИзменении(Элемент)
	Если ПользовательВыбор = Неопределено Или ПустаяСтрока(ПользовательВыбор) Тогда
	    Возврат;
	КонецЕсли;


    // Чтение токена из файла
    Путь = ПолучитьПутьКФайлу(ПользовательВыбор.УникальныйИдентификатор());
    Если ПустаяСтрока(Путь) Тогда
        Сообщить("Путь к файлу токена не указан.");
        Возврат;
    КонецЕсли;

    Попытка
        Док = Новый ТекстовыйДокумент;
        Док.Прочитать(Путь, КодировкаТекста.UTF8);
        Токен = СокрЛП(Док.ПолучитьТекст());
        Если ПустаяСтрока(Токен) Тогда
   			 Сообщить("Файл токена пустой или некорректный.");
   		Возврат;
		КонецЕсли;
        

        // Установка токена в сеансе
        УстановитьТокенВСеанс(Токен);
        Сообщить("Токен установлен.");
    Исключение
        Сообщить("Ошибка чтения токена: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаГенерировать(Команда)
    Токен = ПолучитьТокенИзСеанса();
    Если ПустаяСтрока(Токен) Тогда
        Сообщить("Токен не установлен. Выберите пользователя.");
        Возврат;
    КонецЕсли;

    Если ВводTTL <= 0 Тогда
        Сообщить("Некорректный TTL.");
        Возврат;
    КонецЕсли;

    НовыйТокен = ГенерироватьОграниченныйТокен(ВводTTL);
    Если ПустаяСтрока(НовыйТокен) Тогда
        Сообщить("Ошибка генерации токена.");
    Иначе
        ПолеТокен = НовыйТокен;
        Сообщить("Новый токен сгенерирован.");
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьТокенВСеанс(НовыйТокен) Экспорт
    // Записываем строку прямо в параметр сеанса
    ПараметрыСеанса.Токен = НовыйТокен;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТокенИзСеанса() Экспорт
    // Проверяем, что параметр задан и непустой
    Если ЗначениеЗаполнено(ПараметрыСеанса.Токен) Тогда
        Возврат ПараметрыСеанса.Токен;
    КонецЕсли;
    Возврат "";
КонецФункции

&НаСервереБезКонтекста
Функция ГенерироватьОграниченныйТокен(TTL_Часы) Экспорт
    Адрес = Константы.АдресХранилища.Получить();
    Порт = Число(Константы.ПортХранилища.Получить());
    Токен = ПолучитьТокенИзСеанса();

    Если ПустаяСтрока(Адрес) Или ПустаяСтрока(Токен) Тогда
        Возврат "";
    КонецЕсли;

    Соединение = Новый HTTPСоединение(Адрес, Порт);
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("X‑Vault‑Token", Токен);
    Заголовки.Вставить("Content‑Type", "application/json");

    TTL = Формат(TTL_Часы, "ЧГ=") + "h";
    Тело = "{""ttl"":""" + TTL + """}";

    Запрос = Новый HTTPЗапрос("/v1/auth/token/create");
    Запрос.Заголовки = Заголовки;
    Запрос.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);

    Ответ = Соединение.ОтправитьДляОбработки(Запрос);
    Если Ответ.КодСостояния <> 200 Тогда
        Возврат "";
    КонецЕсли;

    JSON = Новый ЧтениеJSON;
    JSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
    Данные = ПрочитатьJSON(JSON);
    Возврат Данные.auth.client_token;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПутьКФайлу(UID) Экспорт
    Ссылка = Справочники.Пользователи.ПолучитьСсылку(UID);
    Если Ссылка = Неопределено Тогда
        Возврат "";
    КонецЕсли;

    Объект = Ссылка.ПолучитьОбъект();
    Возврат СокрЛП(Объект.Токен);
КонецФункции
